Repository: Stanford-Online/openedx-themes
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: There are invalid keywords in your message. Please check the following keywords and try again:
ar: تتضمّن رسالتك كلمات رئيسية غير صحيحة. يُرجى التحقّق من الكلمات الرئيسية التالية والمحاولة مجدداً:

source: Test email sent! Please check your inbox. Don't forget to save!
ar: تمّ إرسال رسالة تجريبية! تحقّق رجاءً من صندوق بريدك. ولا تنسَ حفظها!

source: This will overwrite the current message with the default one. Do you wish to continue?
ar: سيتمّ استبدال الرسالة التلقائية بالرسالة الحالية. هل تريد المتابعة؟

source: Timer has expired
ar: انتهى الوقت المحدّد

source: Error generating student responses. Please try again.
ar: حدث خطأ في استدرار إجابات الطلاب. يُرجى المحاولة مجدداً.

source: Error generating Open Responses. Please try again.
ar: حدث خطأ في استدرار إجابات مفتوحة. يُرجى المحاولة مجدداً.

source: Error generating Course Forum Report. Please try again.
ar: حدث خطأ في استدرار تقرير عن المنتدى حول المنهاج. يُرجى المحاولة مجدداً.

source: Error generating Student Forum Report. Please try again.
ar: حدث خطأ في استدرار تقرير عن منتدى المنهاج. يُرجى المحاولة مجدداً.

source: Error getting student responses. Please try again.
ar: حدث خطأ في الحصول على إجابات الطلاب. يُرجى المحاولة مجدداً.

source: Error getting Open Responses. Please try again.
ar: حدث خطأ في الحصول على إجابات مفتوحة. يُرجى المحاولة مجدداً.

source: Error getting Course Forums data. Please try again.
ar: حدث خطأ في الحصول على بيانات عن منتديات المنهاج. يُرجى المحاولة مجدداً.

source: Error getting Student Forums data. Please try again.
ar: حدث خطأ في الحصول على بيانات عن منتديات الطلاب. يُرجى المحاولة مجدداً.

source: Error fetching list for role
ar: حدث خطأ في استعراض القائمة بحثاً عن دور

source: Select a Type
ar: إختر نوعاً

source: Error fetching problem or section data
ar: حدث خطأ في البحث عن مشكلة أو بيانات القسم

source: Query is incomplete. Please make all the selections.
ar: الاستفسار ناقص. يُرجى التأكّد من جميع الاختيارات.

source: Error getting saved temp queries
ar: حدث خطأ في الحصول على الاستفسارات المؤقتة المحفوظة

source: Error getting saved queries
ar: حدث خطأ في الحصول على الاستفسارات المحفوظة

source: Error saving group name
ar: حدث خطأ في حفظ إسم المجموعة

source: Aggregating Queries
ar: تجميع الاستفسارات

source: Error getting students
ar: حدث خطأ في الحصول على الطلاب

source: Sorry, we're having a problem with this query. Please delete this row and try again.
ar: عذراً، نواجه مشكلة مع هذا الاستفسار. يُرجى حذف هذا السطر والمحاولة مجدداً.

source: Sorry, we're having a problem with this query. Please delete this row and try again.
ar: عذراً، نواجه مشكلة مع هذا الاستفسار. يُرجى حذف هذا السطر والمحاولة مجدداً.

source: Error saving query
ar: حدث خطأ في حفظ الاستفسار

source: Error getting estimated
ar: حدث خطأ في الحصول على تقديرات

source: Calculating
ar: احتساب

source: 0 students selected
ar: تمّ اختيار صفر 0 طالب

source: approx <%= numStudents %> students selected
ar: تمّ اختيار <% numStudents =%> الطلاب

source: You are about to send an email titled '<%= subject %>' to <%= to_option %>. Is this OK?
ar: أنت على وشك إرسال بريد إلكتروني بعنوان '<% subject =%>' إلى <% to_option =%>. هل أنت موافق؟

source: Are you sure you want to delete the file <%= file %>? This cannot be undone.
ar: هل أنت واثق من أنك تريد حذف الملف <% file =%>؟ لا يسعك التراجع ذلك.

source: The file <%= file %> was successfully deleted.
ar: تمّ حذف الملف <% file =%> بنجاح.

source: Error deleting the file <%= file %>. Please try again.
ar: حدث خطأ في حذف الملف <% file =%>. يُرجى المحاولة مجدداً.

source: Error getting forum csv
ar: حدث خطأ في الحصول على

source: Last Attempt
ar: المحاولة الأخيرة

source: First Attempt
ar: المحاولة الأولى

source: The name that appears on your Statements of Accomplishment. Other learners never see your full name.
ar: الإسم الذي يبرز على شهادة إتمام المنهاج. لكنّ المتعلمين الآخرين لا يرون أبداً اسمك الكامل.

source: Whitelist a user
ar: أدرج مستخدماً على القائمة البيضاء

source: Add a user to the whitelist for a course
ar: أضف مستخدماً على القائمة البيضاء لمتابعة منهاج

source: username
ar: إسم المستخدِم

source: course_id
ar: الرقم التعريفي_المنهاج

source: De-whitelist a user
ar: أزِل مستخدماً عن القائمة البيضاء

source: Remove a user from the whitelist for a course
ar: أزِل مستخدماً عن القائمة البيضاء للمنهاج

source: View user whitelist
ar: استعرض القائمة البيضاء للمستخدمين

source: View the list of whitelisted users for a course
ar: استعرض قائمة المستخدمين المدرجين على القائمة البيضاء لمتابعة منهاج معيّن

source: Generate a single certificate
ar: استحداث إفادة واحدة

source: Put a request on the queue to recreate the certificate for a particular user in a particular course
ar: وضع طلب في الانتظار من أجل إعادة استصدار شهادة لمستخدم معيّن تابع منهاجاً معيّناً

source: grade
ar: درجة/صف

source: designation
ar: تعيين

source: template
ar: نموذج

source: Update certificate status
ar: حدّث وضع الشهادة

source: Update the status of a certificate for a particular user in a particular course
ar: حدّث وضع شهادة مستخدم معيّن تابع منهاجاً معيّناً

source: status (defaults to `unavailable`)
ar: تحديد (الوضعية التلقائية على أساس "غير متوافر")

source: Execute Command
ar: نفّذ الأمر

source: %(university_name)s pursues the science of learning. Online learners are important participants in that pursuit. The information we gather from your engagement with our instructional offerings makes it possible for faculty, researchers, designers and engineers to continuously improve their work and, in that process, build learning science.
ar: تتخصّص %(university_name)s في علم التعلّم. ويشكّل المتعلّمون عبر الإنترنت مشاركين أساسيين في هذه المسيرة. فبفضل المعلومات التي نجمعها من خلال مشاركتكم، والدروس التي نقدّمها، يصبح من الممكن بالنسبة للكليّة، والباحثين، والمصمّمين، والمهندسين، الاستمرار في تحسين عملهم، وفي خلال هذه العملية تطوير علم التعلّم.

source: By registering as an online learner, you are also participating in research intended to enhance Stanford's instructional offerings as well as the quality of learning and related sciences worldwide. In the interest of research, you may be exposed to some variations in the course materials. Stanford does not use learner data for any purpose beyond the University's stated missions of education and research. For purposes of research, we may share information we collect from online learning activities, including %(link_start)sPersonally Identifiable Information%(link_end)s, with researchers beyond Stanford. However, your Personally Identifiable Information will only be shared as permitted by applicable law, will be limited to what is necessary to perform the research, and will be subject to an agreement to protect the data. We may also share with the public or third parties aggregated information that does not personally identify you. Similarly, any research findings will be reported at the aggregate level and will not expose your personal identity.
ar: عند التسجيل كمتعلّم عبر الإنترنت، أنت تشارك أيضاً في البحث الهادف إلى تحسين موادّ جامعة "ستانفورد" التعليمية، ونوعية التعليم والعلوم ذات الصلة في مختلف أنحاء العالم. بهدف إتمام البحث على أفضل نحو، قد يتمّ منحك المادّة الدراسية بطرق متنوّعة. لا تستخدم "ستانفورد" بيانات المتعلّم لغرضٍ معيّن ما خلا مهام التربية والبحث التي كانت الجامعة قد أعلنت عنها. لغايات تتعلّق بالبحث، قد نطلع باحثين من خارج "ستانفورد" على المعلومات التي جمعناها من أنشطة التعلّم الإلكترونية، بما في ذلك %(link_start)sبياناتك الشخصية%(link_end)s. سيتمّ تبادل هذه البيانات ضمن الحدود التي يجيزها القانون المطبّق فقط، وسيقتصر ذلك على ما هو ضروريّ لإتمام البحث، استناداً إلى أحكام اتّفاق لحماية البيانات. ومن المحتمل كذلك أن نطلع الجمهور أو أطرافاً ثالثة على معلومات كليّة لا تتمّ فيها تسميتك شخصياً. كذلك، سيتمّ نشر أيّ نتيجة من نتائج البحث على المستوى الكليّ، من دون الكشف عن هويّتك الشخصية.

source: Please read our %(link_start)sPrivacy Policy%(link_end)s for more information regarding the processing, transmission and use of data collected through the Stanford Online website and Stanford's Lagunita platform.
ar: يرجى قراءة %(link_start)sسياستنا المتعلقة بالخصوصية%(link_end)s للحصول على المزيد من المعلومات حول عملية معالجة البيانات التي يتمّ جمعها عبر موقع "ستانفورد" الإلكتروني ومنصّة "لاغونيتا" الإلكترونية الخاصة بستانفورد، فضلاً عن عملية نقل هذه البيانات واستخدامها.
